Revit 2027 API
IntegerParameterValue(Int32) Constructor
 Value constructor
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IntegerParameterValue(
	int value
)
Public Sub New (
	value As Integer
)
public:
IntegerParameterValue(
	int value
)
new :
        value : int -> IntegerParameterValue
Parameters
value Int32
See Also
Reference
IntegerParameterValue Class
IntegerParameterValue Overload
Autodesk.Revit.DB Namespace